var countrygrid = [
    ['ش', 'و', 'ب', 'ي', 'ا', 'ظ', 'ث', 'ق', 'ك', 'م', 'خ', 'ض'],
    ['ة', 'ف', 'ر', 'ع', 'ة', 'د', 'م', 'ث', 'د', 'و', 'ح', 'خ'],
    ['ق', 'ك', 'ق', 'ش', 'ا', 'ج', 'ي', 'م', 'ظ', 'ق', 'ف', 'ا'],
    ['ن', 'و', 'ة', 'ف', 'ر', 'I', 'خ', 'و', 'د', 'ث', 'چ', 'ي'],
    ['ض', 'ك', 'ظ', 'ن', 'ع', 'و', 'ك', 'و', 'ب', 'ل', 'ن', 'ك'],
    ['ش', 'و', 'ن', 'د', 'ض', 'ش', 'ق', 'ض', 'خ', 'ف', 'و', 'ن'],
    ['د', 'ش', 'ص', 'ش', 'ن', 'ب', 'ح', 'ف', 'چ', 'د', 'ن', 'ث'],
    ['و', 'ع', 'ن', 'ن', 'ة', 'و', 'ض', 'ط', 'ا', 'ك', 'م', 'ط'],
    ['ي', 'ن', 'ف', 'ق', 'ن', 'ل', 'ف', 'ط', 'و', 'ق', 'ظ', 'و'],
    ['ت', 'ة', 'ة', 'ت', 'ص', 'ا', 'خ', 'و', 'ن', 'م', 'و', 'ف'],
    ['ة', 'ن', 'ڠ', 'ب', 'ا', 'ص', 'و', 'ف', 'ح', 'د', 'ح', 'ك'],
    ['ن', 'ش', 'ش', 'ق', 'ظ', 'ش', 'ح', 'خ', 'ف', 'ه', 'ي', 'ا']];

var countrynames = ['ايبو', 'بولا', 'چاون', 'كوكو', 'ايه', 'ابڠ', 'ايكن', 'بوكو', 'دويت',
    'ميجا'];


ws = new WordSearch({
        "grid": countrygrid, // Your grid to search
        "words": countrynames, // The list of words to find
        "parentId": "mysearchtask",
        "onFindWord": function() { // When a word is found...
          console.log(this.getScore()); // Log score
          console.log(this.getTiming()); // Log time to find each word
        } 
    });