var countrygrid = [
    ['س', 'و', 'ب', 'ڠ', 'و', 'ر', 'و', 'ب', 'ك', 'م', 'ر', 'ض'],
    ['ك', 'ف', 'ر', 'ع', 'ة', 'د', 'م', 'ث', 'د', 'و', 'ن', 'خ'],
    ['و', 'ك', 'ڠ', 'ا', 'و', 'ر', 'ب', 'م', 'ظ', 'ق', 'ت', 'ا'],
    ['ل', 'و', 'ة', 'ف', 'ر', 'ڠ', 'خ', 'و', 'س', 'ث', 'ا', 'ي'],
    ['ه', 'ك', 'ر', 'و', 'ع', 'ك', 'ن', 'د', 'و', 'ل', 'ي', 'ك'],
    ['ق', 'ر', 'و', 'ت', 'ك', 'و', 'د', 'ض', 'ت', 'ف', 'و', 'ن'],
    ['د', 'ش', 'ص', 'ش', 'ن', 'ب', 'ح', 'ف', 'و', 'د', 'ن', 'ب'],
    ['و', 'ت', 'و', 'س', 'ا', 'ك', 'ض', 'ط', 'ڠ', 'ك', 'م', 'و'],
    ['ي', 'ن', 'ف', 'ق', 'ن', 'ل', 'ف', 'ط', 'و', 'ق', 'ظ', 'ت'],
    ['ت', 'ة', 'ة', 'ت', 'ص', 'و', 'د', 'و', 'ر', 'ب', 'و', 'و'],
    ['ة', 'ن', 'ڠ', 'ب', 'ا', 'ص', 'و', 'ف', 'ح', 'د', 'ح', 'ل'],
    ['ڠ', 'ي', 'چ', 'و', 'ك', 'ش', 'ح', 'خ', 'ف', 'ه', 'ي', 'ا']];

var countrynames = ['كوچيڠ', 'بوروڠ', 'سوتوڠ', 'كاسوت', 'برواڠ', 'بوتول', 'دوكتور', 'رنتاي', 'سكوله',
    'برودو'];


ws = new WordSearch({
        "grid": countrygrid, // Your grid to search
        "words": countrynames, // The list of words to find
        "parentId": "mysearchtask",
        "onFindWord": function() { // When a word is found...
          console.log(this.getScore()); // Log score
          console.log(this.getTiming()); // Log time to find each word
        } 
    });